---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Height
zh: 高度
source: html/6ae0a4c9-f867-d9c3-686f-464c62c1d0ed.htm
---
# Autodesk.Revit.DB.IConnector.Height Property

**中文**: 高度

The height of the connector.

## Syntax (C#)
```csharp
double Height { get; }
```

## Remarks
This property is used to retrieve the height of the connector.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the connector's shape is not rectangular.